; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob45) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate8)
	(at pallet1 distributor0)
	(clear crate9)
	(at pallet2 distributor1)
	(clear crate6)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 365)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 259)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 26)
	(at crate1 distributor1)
	(on crate1 pallet2)
	(= (weight crate1) 86)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 58)
	(at crate3 depot0)
	(on crate3 crate2)
	(= (weight crate3) 62)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 9)
	(at crate5 depot0)
	(on crate5 crate4)
	(= (weight crate5) 7)
	(at crate6 distributor1)
	(on crate6 crate1)
	(= (weight crate6) 13)
	(at crate7 distributor0)
	(on crate7 crate0)
	(= (weight crate7) 85)
	(at crate8 depot0)
	(on crate8 crate5)
	(= (weight crate8) 7)
	(at crate9 distributor0)
	(on crate9 crate7)
	(= (weight crate9) 59)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate4)
		(on crate1 crate9)
		(on crate2 pallet0)
		(on crate3 pallet2)
		(on crate4 crate2)
		(on crate5 pallet1)
		(on crate6 crate5)
		(on crate7 crate6)
		(on crate8 crate7)
		(on crate9 crate3)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist0 crate8 crate5 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate5)
   added: (lifting hoist0 crate8) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 10
2. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 7
   goals met: 1 of 10
3. (lift hoist1 crate9 crate7 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate7)
   added: (lifting hoist1 crate9) (clear crate7)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 10
4. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 59
   goals met: 1 of 10
5. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 10
6. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 59 to 0
   goals met: 1 of 10
7. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 10
8. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 22 to 32
   goals met: 1 of 10
9. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 7 to 0
   goals met: 1 of 10
10. (lift hoist0 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate4)
   added: (lifting hoist0 crate5) (clear crate4)
   changed: (fuel-cost) from 32 to 33
   goals met: 1 of 10
11. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 7
   goals met: 1 of 10
12. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 33 to 43
   goals met: 1 of 10
13. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 7 to 14
   goals met: 1 of 10
14. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 43 to 53
   goals met: 1 of 10
15. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   changed: (current_load truck0) from 14 to 73
   goals met: 1 of 10
16. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 53 to 63
   goals met: 1 of 10
17. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 73 to 66
   goals met: 1 of 10
18. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 63 to 73
   goals met: 1 of 10
19. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 73 to 74
   goals met: 1 of 10
20. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   changed: (current_load truck0) from 66 to 75
   goals met: 1 of 10
21. (lift hoist0 crate3 crate2 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate2)
   added: (lifting hoist0 crate3) (clear crate2)
   changed: (fuel-cost) from 74 to 75
   goals met: 1 of 10
22. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 62
   goals met: 1 of 10
23. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 75 to 85
   goals met: 1 of 10
24. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 75 to 66
   goals met: 1 of 10
25. (lift hoist2 crate6 crate1 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate1)
   added: (lifting hoist2 crate6) (clear crate1)
   changed: (fuel-cost) from 85 to 86
   goals met: 1 of 10
26. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 62 to 75
   goals met: 1 of 10
27. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 75 to 13
   goals met: 1 of 10
28. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 86 to 96
   goals met: 1 of 10
29. (drop hoist1 crate5 crate7 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate7)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate7)
   goals met: 1 of 10
30. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 13 to 0
   goals met: 1 of 10
31. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 96 to 106
   goals met: 1 of 10
32. (drop hoist2 crate3 crate1 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate1)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate1)
   goals met: 1 of 10
33. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 66 to 7
   goals met: 1 of 10
34. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 106 to 116
   goals met: 1 of 10
35. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 116 to 126
   goals met: 1 of 10
36. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 13
   goals met: 1 of 10
37. (lift hoist1 crate5 crate7 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate7)
   added: (lifting hoist1 crate5) (clear crate7)
   changed: (fuel-cost) from 126 to 127
   goals met: 1 of 10
38. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 13 to 20
   goals met: 1 of 10
39. (lift hoist1 crate7 crate0 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate0)
   added: (lifting hoist1 crate7) (clear crate0)
   changed: (fuel-cost) from 127 to 128
   goals met: 1 of 10
40. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   changed: (current_load truck1) from 20 to 105
   goals met: 1 of 10
41. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 128 to 129
   goals met: 1 of 10
42. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 7 to 33
   goals met: 1 of 10
43. (drop hoist0 crate4 crate2 depot0)
   deleted: (lifting hoist0 crate4) (clear crate2)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate2)
   goals met: 2 of 10
44. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 129 to 139
   goals met: 2 of 10
45. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 33 to 7
   goals met: 2 of 10
46. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 139 to 149
   goals met: 2 of 10
47. (drop hoist0 crate0 crate4 depot0)
   deleted: (lifting hoist0 crate0) (clear crate4)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate4)
   goals met: 3 of 10
48. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 105 to 98
   goals met: 3 of 10
49. (drop hoist1 crate5 pallet1 distributor0)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 pallet1)
   goals met: 4 of 10
50. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 98 to 85
   goals met: 4 of 10
51. (drop hoist1 crate6 crate5 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate5)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate5)
   goals met: 5 of 10
52. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck1) from 85 to 0
   goals met: 5 of 10
53. (drop hoist1 crate7 crate6 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate6)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate6)
   goals met: 6 of 10
54. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 7 to 0
   goals met: 6 of 10
55. (drop hoist1 crate8 crate7 distributor0)
   deleted: (lifting hoist1 crate8) (clear crate7)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 crate7)
   goals met: 7 of 10
56. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 149 to 159
   goals met: 7 of 10
57. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 59
   goals met: 7 of 10
58. (lift hoist2 crate3 crate1 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate1)
   added: (lifting hoist2 crate3) (clear crate1)
   changed: (fuel-cost) from 159 to 160
   goals met: 7 of 10
59. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 59 to 121
   goals met: 7 of 10
60. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 160 to 161
   goals met: 7 of 10
61. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 121 to 207
   goals met: 7 of 10
62. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 207 to 145
   goals met: 7 of 10
63. (drop hoist2 crate3 pallet2 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 pallet2)
   goals met: 8 of 10
64. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 145 to 86
   goals met: 8 of 10
65. (drop hoist2 crate9 crate3 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate3)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate3)
   goals met: 9 of 10
66. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 86 to 0
   goals met: 9 of 10
67. (drop hoist2 crate1 crate9 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate9)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate9)
   goals met: 10 of 10
